{"class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "dtype": "float32", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "conv2d_1", "batch_input_shape": [null, 48, 48, 1], "activation": "relu", "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_2", "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_3", "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_4", "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_5", "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 256, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_5"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_6", "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 256, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_6"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "relu", "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_2", "activation": "relu", "kernel_regularizer": null, "units": 4096, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_3", "activation": "linear", "kernel_regularizer": null, "units": 7, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}